# ProjectRevisionEnumeration Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ProjectRevisionEnumeration Property
ParameterTypeId Class See Also
---
"Numbering"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ProjectRevisionEnumeration { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProjectRevisionEnumeration As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ProjectRevisionEnumeration {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace